In [2]:
import pandas as pd

In [21]:
cpi = pd.read_excel("/Users/tanushree/Desktop/441/consumer-price-inflation.xlsx")

In [22]:
cpi.head()

,Country Code,IMF Country Code,Country,Indicator Type,Series Name,1970,1971,1972,1973,1974,...,2016,2017,2018,2019,2020,2021,2022,2023,2024,Note
0,ABW,314.0,Aruba,Inflation,Headline Consumer Price Inflation,NaN,NaN,NaN,NaN,NaN,...,-0.890000,-0.474,3.58,4.257,1.222000,0.744000,5.520000,3.363,1.712000,Annual average inflation
1,AFG,512.0,Afghanistan,Inflation,Headline Consumer Price Inflation,25.510000,25.510000,-12.520000,-10.680000,10.230000,...,4.380000,4.976,0.63,2.302,5.443000,5.062000,10.600000,-7.714,-6.601186,Annual average inflation
2,AGO,614.0,Angola,Inflation,Headline Consumer Price Inflation,7.970000,5.780000,15.800000,15.670000,27.420000,...,32.377731,29.844,19.63,17.079,21.024000,23.846111,23.826819,13.639,28.240495,Annual average inflation
3,ALB,914.0,Albania,Inflation,Headline Consumer Price Inflation,NaN,NaN,NaN,NaN,NaN,...,1.291234,1.987,2.03,1.411,1.620887,2.041472,6.725203,4.769,2.214490,Annual average inflation
4,ARE,466.0,United Arab Emirates,Inflation,Headline Consumer Price Inflation,21.984699,21.984699,21.984699,21.984699,21.984699,...,1.619795,1.967,3.06,-1.931,-2.079403,0.180000,4.827889,1.624,1.663365,Annual average inflation

In [13]:
chi = pd.read_excel("/Users/tanushree/Desktop/441/chicago-unemp.xlsx")
htn = pd.read_excel("/Users/tanushree/Desktop/441/houston-unemp.xlsx")
phx = pd.read_excel("/Users/tanushree/Desktop/441/phoenix-unemp.xlsx")
la = pd.read_excel("/Users/tanushree/Desktop/441/los-angeles-unemp.xlsx")
ny = pd.read_excel("/Users/tanushree/Desktop/441/new-york-unemp.xlsx")

In [14]:
chi.head()

   Year Period  labor force  employment  unemployment  unemployment rate
0  1990    Jan      4165050     3877704        287346                6.9
1  1990    Feb      4158474     3883640        274834                6.6
2  1990    Mar      4158961     3895016        263945                6.3
3  1990    Apr      4159901     3887001        272900                6.6
4  1990    May      4168759     3910275        258484                6.2

In [16]:
htn.head()

   Year Period  labor force  employment  unemployment  unemployment rate
0  1990    Jan      1984076     1881055        103021                5.2
1  1990    Feb      1988590     1886513        102077                5.1
2  1990    Mar      1997856     1903040         94816                4.7
3  1990    Apr      2012121     1916293         95828                4.8
4  1990    May      2032188     1933128         99060                4.9

In [18]:
phx.head()

   Year Period  labor force  employment  unemployment  unemployment rate
0  1990    Jan      1146957     1094079         52878                4.6
1  1990    Feb      1148735     1098870         49865                4.3
2  1990    Mar      1150741     1101568         49173                4.3
3  1990    Apr      1152870     1103587         49283                4.3
4  1990    May      1158722     1108526         50196                4.3

In [19]:
la.head()

   Year Period  labor force  employment  unemployment  unemployment rate
0  1990    Jan      5922433     5612177        310256                5.2
1  1990    Feb      5939564     5643174        296390                5.0
2  1990    Mar      5941583     5655980        285603                4.8
3  1990    Apr      5893238     5605138        288100                4.9
4  1990    May      5900287     5611520        288767                4.9

In [20]:
ny.head()

,Year,Period,labor force participation rate,employment-population ratio,labor force,employment,unemployment,unemployment rate
0,1976,Jan,58.1,52.1,7661586,6872892,788694,10.3
1,1976,Feb,58.0,52.1,7659445,6871925,787520,10.3
2,1976,Mar,58.0,52.1,7660215,6875212,785003,10.2
3,1976,Apr,58.0,52.1,7667961,6885824,782137,10.2
4,1976,May,58.1,52.2,7679696,6898103,781593,10.2